{"[0, 0, 0, 0, 0, 0]": [{"ID": "PROJ008", "Supervisor": "George Eleftheriades", "Project Title": NaN, "Status": "Open", "Project Description": NaN, "TagA": NaN, "TagB": NaN, "Students": NaN, "TagBVector": [0, 0, 0, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": "PROJ080", "Supervisor": "Andreas Moshovos", "Project Title": "FPGA or ASIC implementation of a Pattern Correlation Engine for Neuron Probe interfaces", "Status": "Open", "Project Description": "The team is to implement a prototype of a hardware engine that implements Pearson Correlation. This is used to process signals collected in real time from the brain and to detect certain patterns of interest. Alternatively, the team may choose to implement a software only version on a very low power platform.", "TagA": "Computer Hardware and Computer Networks", "TagB": "Controls, Communications and Signal Processing", "Students": NaN, "TagBVector": [0, 0, 0, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": "PROJ085", "Supervisor": "Khoman Phang", "Project Title": NaN, "Status": "Open", "Project Description": NaN, "TagA": NaN, "TagB": NaN, "Students": NaN, "TagBVector": [0, 0, 0, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020221, "Supervisor": "Raviraj Adve", "Project Title": "Obstacle avoidance using a radar", "Status": "Closed", "Project Description": "Recently, mmwave radar has been used for many \"civilian\" applications like controlling a cell phone using gestures. In this project the students will develop a radar-based obstacle avoidance system, e.g., for the visually impaired or for emergency responders. Ideally, a 2D radar would be used to provide such responders with a visualization of their surrounding area.", "TagA": "Computer Hardware and Computer Networks", "TagB": "Controls, Communications and Signal Processing", "Students": "Michela Trozzo, Dana Kokoska, Stanko Oparnica, Seyedmahmoud Mohammadi", "TagBVector": [0, 0, 0, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020299, "Supervisor": "Margaret Chapman", "Project Title": "Systems Control for Leukemia Analysis and Treatment", "Status": "Closed", "Project Description": "This project is at the intersection of systems control theory and the study of acute myeloid leukemia (AML), which is a type of blood cancer. In practice, AML patients are heterogeneous with different baseline status, genetic mutations, ages, medical history, etc. However, despite these differences, patients are typically treated using similar or even identical therapeutic strategies. Unfortunately, many patients ultimately relapse. There is a critical need for a methodology to adapt therapeutic strategies continually to an individual patient based on her current condition and her prior medical history. A preliminary long-term goal is to develop and show the feasibility of such an adaptive methodology on leukemia and healthy cell populations treated in the laboratory.", "TagA": "Controls, Communications and Signal Processing", "TagB": NaN, "Students": "Yuheng Wang, Yutian Dai, Chong Xu", "TagBVector": [0, 0, 0, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020220, "Supervisor": "Sean Hum", "Project Title": "Real-time modulator/demodulator for digital HF radio signals", "Status": "Closed", "Project Description": "This project is suitable for teams teams interested in digital communications and DSP. It involves developing a real-time signal processing platform (e.g. FPGA or DSP) to demodulate digital radio signals used for intercontinental communications in weak signal conditions (FT8 and FT4), in real time. Experience with FPGAs and/or DSPs is a useful asset.", "TagA": "Computer Hardware and Computer Networks", "TagB": "Controls, Communications and Signal Processing", "Students": "Hyun Yung Lee, Yong Hui Kwon, Xueqing Wang, Jonathan Wong", "TagBVector": [0, 0, 0, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020213, "Supervisor": "Khoman Phang", "Project Title": "June 11 test project", "Status": "Closed", "Project Description": "test", "TagA": NaN, "TagB": NaN, "Students": "Student1 Test, Student2 Test", "TagBVector": [0, 0, 0, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020249, "Supervisor": "Kostas Plataniotis", "Project Title": "Active Tissue Histology Learning in Computational Pathology", "Status": "Closed", "Project Description": "Project Description:", "TagA": NaN, "TagB": NaN, "Students": "Panagiotis Athanasopoulos, Sarp Kavalcioglu, Mohit Saravanan", "TagBVector": [0, 0, 0, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020225, "Supervisor": "Belinda Wang", "Project Title": "Design a simple drawing interface using the DE1-SoC board", "Status": "Closed", "Project Description": "Design guideline:", "TagA": "Computer Networks and Computer Hardware", "TagB": NaN, "Students": "Yu Li, Yiming Li", "TagBVector": [0, 0, 0, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020267, "Supervisor": "Azadeh Yadollahi", "Project Title": "Diagnosis of Obstructive Sleep Apnea utilizing Computer Vision and Deep Learning", "Status": "Closed", "Project Description": "Background & Research:", "TagA": NaN, "TagB": NaN, "Students": "Safeerah Zainab, Samara Jalal, Jacqueline Midroni, Aninda Poddar", "TagBVector": [0, 0, 0, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}], "[0, 0, 0, 0, 0, 1]": [{"ID": "PROJ084", "Supervisor": "Glenn Gulak", "Project Title": "CryptoNets", "Status": "Open", "Project Description": NaN, "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": NaN, "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020297, "Supervisor": "Hamid Timorabadi", "Project Title": "Epidemic Modelling with Reinforcement Learning", "Status": "Open", "Project Description": "Creating a mathematical model for epidemic spread in a population has been a long-standing effort. Solutions range from simple analytical models to agent-based modelling. The most extensively studied model is a category called compartmental models, represented by a segmentation of the population into \"susceptible, infected, and recovered\" sub-populations. In this project, we aim to use Reinforcement Learning to achieve and surpass the capabilities of compartmental models.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": NaN, "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020161, "Supervisor": "Tarek Abdelrahman", "Project Title": "Neural Debugger", "Status": "Closed", "Project Description": "Bug detection and debugging is a challenging and time-consuming part of software development. Finding even simple bugs or typo can cost hours or even days for a human programmer, sometimes manually checking line-by-line for logical error. We propose the Neural Debugger, a tool to automatically detect and highlight potential bugs in source code. It can be a plug-in for code editors such as Visual Studio Code to highlight potential sources of logical errors, as well as a possible typo, error-prone patterns, code-smells, and general bad practices. We will leverage state of the art deep neural networks to help detect complex patterns.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Chenhao Liu, Jianyang Wu, Jiajie Xu, Jue Liu", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020163, "Supervisor": "Tarek Abdelrahman", "Project Title": "Panacea", "Status": "Closed", "Project Description": "Today, walk-in clinics fill an important gap in our health-care system and many Canadians rely on walk-in clinics as an alternative to visiting a family doctor. The idea is to design a system that makes it easier for patients to find the optimal walk-in clinic to visit and for clinics to optimally manage the bookings.", "TagA": "Software", "TagB": NaN, "Students": "Yu Tang, Abhishek Arya, Rita Lu, Muhammad Waheed", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020207, "Supervisor": "Stewart Aitchison", "Project Title": "Infection disease tracker", "Status": "Closed", "Project Description": "In 2020, we saw first-hand the devastating impact a pandemic will have on the world stage. Covid-19 spread across the global in a matter of months causing the world economic to grind to a halt. In our communities we saw the rate of spread of this disease and watch as the government and our health care system play a game of cat and mouse. They did their best to find and treat infected people. Despite all their efforts, Covid-19 still managed to spread and infect. It almost seemed like our health care system was one-step behind the whole time. With the infectious disease tracker, we want to help the health care system get ahead of the infections. Our idea is to use,", "TagA": "Software", "TagB": NaN, "Students": "Kodikara Perera, Rehan Gill, Ryan Valdez, Haozhe Sun", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020268, "Supervisor": "Cristiana Amza", "Project Title": "Virtual Wardrobe", "Status": "Closed", "Project Description": "With Covid-19 still a concern even as cities and stores begin to open up, shopping outside and in malls come with their associated risks.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Mike Shi, John Esguerra, Trevor Siow, Yi Chen", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020266, "Supervisor": "Cristiana Amza", "Project Title": "Semantic-Aware Online Workload Characterization and Prediction for Large Scale Systems", "Status": "Closed", "Project Description": "Analyzing behavioral patterns of workloads is critical to understanding Cloud computing environments. However, until recently, allocation of resources to Virtual Machines running the workloads were static, based on user specifications. Dynamic, on-line resource consolidation based on workload recognition and resource usage prediction can be used for accurate resource prediction of the running workloads. This project will involve extending existing research done in this area to large scale systems. Predicting resource usage can then be used for things like alerting and auto-scaling.", "TagA": "Software", "TagB": NaN, "Students": "Gerin Amalaraj, Nekhil Nagia, Polina Govorkova, Joshua Wong", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020165, "Supervisor": "Jason Anderson", "Project Title": "Voice Cloning", "Status": "Closed", "Project Description": "Methods of AI voice cloning are used to generate synthetic speech, closely resembling a targeted human voice. In some situations, the difference between the real and fake voice is imperceptible to the average person. Due to these features, voice cloning is now a highly desired feature for personalized speech interfaces in order to provide a high-quality voice.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Zhiren Zhan, Qintong Han, Qi Meng, Yu Wang", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020258, "Supervisor": "Jason Anderson", "Project Title": "Customizable Outfit Generator App", "Status": "Closed", "Project Description": "The goal of this project is to create a mobile app that allows users to easily follow current fashion trends while making the most of the clothing they already own. The app will manage the user's clothing in a virtual wardrobe and allow them to filter clothes by category, generating custom outfit suggestions based on their existing clothes. Additionally, there are many possible optional features that can be added such as giving shopping suggestions via a smart explore page or filtering outfits by season.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Yan Li, Katie Chiang, Qing Lu, Minghao Qi", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020282, "Supervisor": "Berj Bardakjian", "Project Title": "Identifying EEG Artifacts for Predicting Seizure Onset", "Status": "Closed", "Project Description": "Professor Bardakjian has developed a machine learning EEG-based system for prediction of epileptic seizures and to improve on the false positive rate it will be helpful to deal with EEG artifacts, in particular chewing, eyeblinks and movement. We propose to have the machine learn the features of these artifacts to make sure that the examined data windows that indicate a \"positive detection\" do not have these artifacts.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Eliano Anile, Lucas Rea, Jane Illarionova, Christopher Dryden", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020181, "Supervisor": "Vaughn Betz", "Project Title": "Web-based Photodynamic Therapy Planning and Optimization", "Status": "Closed", "Project Description": "Light is used medically both diagnostically (to image tissue) and therapeutically (to modify tissue, such as destroying tumours). A major challenge for both these purposes is to simulate how light will behave in complex tissues, so that the measured light can be used to infer tissue structure, or a plan of how to place light probes to destroy a tumour with optically-active drugs can be created. In this project, you will develop a web-based interface to a light simulator created at the University of Toronto to make its use easier for medical practitioners, and to train them in its use.", "TagA": "Software", "TagB": NaN, "Students": "Xiao Dai, Shengxiang Ji, Zihao Chen", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020169, "Supervisor": "Mireille Broucke", "Project Title": "Telecopter", "Status": "Closed", "Project Description": "As drones and remote controls become more and more accessible, and the need for remote/socially distant technology increases, so does the need to explore the intersections of these technologies.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Isamu Poy, Sahar Abdalla, Sebastian Wardzinski, Sarhad Salam", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020175, "Supervisor": "Paul Chow", "Project Title": "Packet Re-Ordering for an FPGA implementation of a BPF (FFShark) for High Speed Networks (100G) Packet Analysis", "Status": "Closed", "Project Description": "The project is based on Wireshark, which is a tool for analyzing network traffic, and a hardware BPF (Berkeley Packet Filter) core that has been built and used in a multiprocessor configuration called FFShark implemented on an FPGA. FFShark currently runs on a FPGA board with two 100G interfaces. We don't have a board with 400G interfaces, but we believe the hardware is capable. This project involves designing for high speed networking traffic. The way FFShark works at high speed is that it has multiple BPF processors. The first thing it does is split out incoming packets and spreads them over the multiple BPF processors, i.e. each BPF processor handles a subset of packets at a slower speed. The problem is that in the current design, it is possible that the packets will finish processing in a different order than they arrived. The problem is similar to out-of-order instruction processing in advanced CPUs. What we would like is to do is to reorder the packets so that they are emitted in the same order as they entered FFShark.", "TagA": "Software", "TagB": "Computer Hardware and Computer Networks", "Students": "Tianyi Zhang, Bruno Almeida, Yuanli Ding", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020300, "Supervisor": "George Eleftheriades", "Project Title": "Enhancements of A Millimeter-Wave Radar for Traffic Control", "Status": "Closed", "Project Description": "The team will develop software for real-time processing of a Frequency-Modulated Continuous-Wave (FMCW) radar signal. The software will interface with a Ka-band radar system, under development at UofT, through a soundcard. This will enable generating audio waveforms for the transmit chirp and processing the received audio signal to determine target range.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Uran Onuk, Johnathon Martin, Syed Ashraf", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020287, "Supervisor": "Natalie Enright Jerger", "Project Title": "RISC-V Soft Core IP Generation for Education", "Status": "Closed", "Project Description": "We will design and implement a RISC-V soft core generator that will be useful in a educational setting. One of the intended uses will be to replace Altera Qsys as used in ECE courses at U of T. The framework will allow for high levels of flexibility and extensibility to make it useful in a variety of applications.", "TagA": "Software", "TagB": "Computer Hardware and Computer Networks", "Students": "Andrew Uderian, Zhi Liu, Zhonglin Huang", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020253, "Supervisor": "Ashvin Goel", "Project Title": "Your Software Project: Talk to the Professor", "Status": "Closed", "Project Description": "If you are looking to do a software-based design project, broadly in the area of systems software, distributed and cloud systems, and mobile systems, and have interesting ideas, feel free to send me an email with your idea, resume and transcripts.", "TagA": "Software", "TagB": NaN, "Students": "Jeff Lo, Haley Cao, Eun Koo, Yu Wen", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020251, "Supervisor": "Ashvin Goel", "Project Title": "Caracal - Distributed Systems Database", "Status": "Closed", "Project Description": "We will be working on the existing distributed database, Caracal. We will attempt to implement node replication and possibly, load balancing. Currently, only one node can handle a partition of data and replication will enable redundancy for reliability or load balancing for performance. There is currently no form of persistence in Caracal. Node redundancy will help with that as well.", "TagA": "Software", "TagB": NaN, "Students": "Abishek Sundar, Alisan Ozkazanc, Ashley Abdel-Sayed", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020308, "Supervisor": "Glenn Gulak", "Project Title": "Automotive Grade Linux (AGL) with Cloud Interface", "Status": "Closed", "Project Description": "In order to accelerate innovation, many automobile manufacturers are migrating to open source software platforms to control all automobile functions including infotainment, sensor controls, navigation, etc.", "TagA": "Software", "TagB": NaN, "Students": "Zohair Mian, Siddharth Vijay, Adeeb Rahman, Martin Janda", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020306, "Supervisor": "Glenn Gulak", "Project Title": "Parallelization of Microsoft SEAL open source fully homomorphic encryption scheme using GPU", "Status": "Closed", "Project Description": "Fully homomorphic encryption schemes allow basic mathematical operations to be performed on ciphertext, the result of which when decrypted is the same as if the operations were performed on the plaintext. This can be useful as machine learning algorithms are often run on 3rd party hardware providing service, and many applications (ex. medical) need to keep their data confidential. This project aims to parallelize existing Microsoft SEAL open source software to increase speed of machine learning applications on confidential data", "TagA": "Software", "TagB": NaN, "Students": "Philippe Johns, Priya Wadhwa", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020192, "Supervisor": "Reza Iravani", "Project Title": "Microgrid Design Tool for Indigenous Communities", "Status": "Closed", "Project Description": "An interface to help planners of remote, electrically isolated communities assess their options for moving from diesel generation to a hybrid or emissions free system. It can potentially build off of existing planning tools from military and resource extraction projects.", "TagA": "Software", "TagB": NaN, "Students": "Benjamin Goodchild, Gabryelle Gunness, Noah Poplove, Kimia Shabahang", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020172, "Supervisor": "Hans-Arno Jacobsen", "Project Title": "AI-Enabled Traffic Camera Feed Transcription.", "Status": "Closed", "Project Description": "There are a plethora of camera feeds available on the Internet, yet many software systems require a transcribed version of the camera feed for ease of processing. For example, traffic cameras show streams of traffic flowing through highways, streets and intersections, while intelligent traffic management systems require information about the number of cars per minute passing a certain point in order to emit traffic warnings or control the traffic flow. Similarly, cameras in and around public transport hubs could provide valuable information about congestion, incidents, and load that can be tracked more easily than the raw camera feed. This project aims to capture online camera fees, pass them through an analysis pipeline, possibly based on machine learning and deep learning classifiers, to ultimately extract actionable information from the stream in real-time. The input to the analysis pipeline is the online camera feed and the output is the actionable information in a format that could be pushed or pulled to and from other systems via APIs provided. The system should be validated over at least ten traffic cameras and provide information about the traffic flow; a successful project would be able to analyze the flow on a highway, an intersection, as well as for the bidirectional flow across the former.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Andrew Lau, Chunqiu Xia, Robert Dermarkar", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020281, "Supervisor": "Hans-Arno Jacobsen", "Project Title": "Workload synthesis and generation for cloud systems", "Status": "Closed", "Project Description": "There are several not mutually exclusive types of applications running on current large-scale clouds, for example compute intensive applications (e.g., machine learning training and inference tasks), I/O intensive applications (e.g., biological sequence analysis), stateless applications (e.g., web servers) and stateful applications (e.g. distributed memory caches). These types of applications exhibit a variety of behaviour in terms of performance and requirements for cloud resources. To evaluate a cloud system or a cloud-based algorithm, it's important to identify its pros and cons by running different kinds of workloads. In this project, students are expected to design a workload synthesis and generation tool for this purpose out of artificial or existing benchmarks, with support for easy exporting to widely used cloud frameworks like Hadoop, Spark and Kubernetes.", "TagA": "Software", "TagB": NaN, "Students": "Adarsh Pala, Seyed Mousavi Derazmahalleh, Khanjan Patel, Chao-Chun Chan", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020240, "Supervisor": "Hans-Arno Jacobsen", "Project Title": "AI-enhanced indexing methods", "Status": "Closed", "Project Description": "Indexing data structures, such as sorting, trees and hashing tables, are widely used in different fields and applications. This project would like to explore AI, particularly machine learning methods, which show potential to predict future trends of data distribution, and is helpful for systems to improve the performance of indexing data structure. We expect students to explore different machine learning methods to predict the data distribution of incoming data, and use machine learning methods to build a novel data structure to index those data. As inspiration, this paper (https://arxiv.org/pdf/1712.01208.pdf) provides some preliminary study on how to use machine learning to implement the functionality of a Hash Table and a B-Tree. This project is challenging since it requires adequate knowledge of both machine learning and data structures. For the design project, we prefer students to use deep learning methods (CNN, RNN, LSTM, etc.) to explore whether a Hash Table, a B-Tree or other indexing data structures could be implemented by DL and what the pros and cons would be relative to traditional means of realizing these index structrues.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Zichun Chong, Beiqi Li, Heng Zhou, Zihang Huang", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020193, "Supervisor": "Hans-Arno Jacobsen", "Project Title": "AI-Enabled Traffic Camera Feed Transcription (Team 2)", "Status": "Closed", "Project Description": "There are a plethora of camera feeds available on the Internet, yet many software systems require a transcribed version of the camera feed for ease of processing. For example, traffic cameras show streams of traffic flowing through highways, streets and intersections, while intelligent traffic management systems require information about the number of cars per minute passing a certain point in order to emit traffic warnings or control the traffic flow. Similarly, cameras in and around public transport hubs could provide valuable information about congestion, incidents, and load that can be tracked more easily than the raw camera feed.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Deep Pandya, Parth Patel, Yuanpeng Wang, Zafeer Khan", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020259, "Supervisor": "Hans-Arno Jacobsen", "Project Title": "Workload synthesis and generation for cloud systems (Team 2)", "Status": "Closed", "Project Description": "There are several not mutually exclusive types of applications running on current large-scale clouds, for example compute intensive applications (e.g., machine learning training and inference tasks), I/O intensive applications (e.g., biological sequence analysis), stateless applications (e.g., web servers) and stateful applications (e.g. distributed memory caches). These types of applications exhibit a variety of behaviour in terms of performance and requirements for cloud resources. To evaluate a cloud system or a cloud-based algorithm, it's important to identify its pros and cons by running different kinds of workloads. In this project, students are expected to design a workload synthesis and generation tool for this purpose out of artificial or existing benchmarks, with support for easy exporting to widely used cloud frameworks like Hadoop, Spark and Kubernetes.", "TagA": "Software", "TagB": NaN, "Students": "Lam Ng, Vincent Valdez, Raihan Faruque, Halim Lee", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020204, "Supervisor": "Ashish Khisti", "Project Title": "Federated Machine Learning: System Design and Practical Architecture", "Status": "Closed", "Project Description": "In this project the team will investigate the design of a distributed machine learning system where training data is distributed across multiple nodes which communicate with a central node to collaboratively train a machine learning model.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Srikara Gummaluru, Erick Mejia Uzeda, Gaoxing Ding, Xin Liao", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020271, "Supervisor": "Frank Kschischang", "Project Title": "User-Friendly Music Jamming App", "Status": "Closed", "Project Description": "The goal of this project to create a way for musicians to play with each other in real time over the internet to themselves or an audience. Video conferencing programs such as Zoom have gained immense popularity due to the COVID-19 situation, but they are unsuitable for playing music in groups in real time due to their latency.", "TagA": "Software", "TagB": NaN, "Students": "Jin Li, Kevin Grafstrom, Yuanou Shen", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020194, "Supervisor": "Hans Kunov", "Project Title": "Tools to improve compliance with academic integrity", "Status": "Closed", "Project Description": "Develop a tool for instilling respect for academic integrity and discouraging cheating in undergraduate engineering assignments.", "TagA": "Software", "TagB": NaN, "Students": "Yitong Wang, Kaifeng Lu, Haonan Sun, Hong Xu", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020274, "Supervisor": "Hans Kunov", "Project Title": "Speech Sanitation", "Status": "Closed", "Project Description": "Preventable flaws in speech can be \"career-limiting.\" In this project, you will tackle one of the following problems (Google the term if needed): 1: Uptalk, 2: Vocal fry, 3: Filler words, or 4: Monotony, with a view to provide real-time, appropriate, discrete feedback to the speaker.", "TagA": "Software", "TagB": NaN, "Students": "Neda Moniri, Kian Moniri, Arshia Ershadi, Tina Tavallaeian", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020242, "Supervisor": "Chi-Guhn Lee", "Project Title": "Reinforcement learning", "Status": "Closed", "Project Description": "The team will be using simulations to operate a vehicle using reinforcement learning, and then investigate the issues with transferring simulated learning to the real world.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Jacob Nauenberg, Jessye Coleman-Shapiro, Nadia Kostiv", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020280, "Supervisor": "Ben Liang", "Project Title": "Designing the communications system for humanitarian/medical supply drones in Rwanda and Central Africa", "Status": "Closed", "Project Description": "Aerlift, a startup founded by UofT engineering graduates, is a drone logistics and delivery company whose mission is to improve access to medical supplies globally. Nearly 3 billion people live in rural areas with limited access to healthcare services. In developing contexts, people may need to walk for hours or up to days to nearby healthcare facilities to receive the supplies or care they need. Aerlift is currently working with African governments and NGOs to increase access to these remote communities. Our software platform allows doctors to order items which are then delivered on-demand by drone. It also facilitates the collection of valuable healthcare data, assists inventory management, and overall helps the government plan its healthcare programming more effectively. The key to an effective supply chain is the rapid movement of both goods and information up and down the entire chain.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Benjamin Kwashigah, Aidan Macleod, Mahnoor Mehboob, Jun Villa", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020289, "Supervisor": "Jorg Liebeherr", "Project Title": "Remote Music Collaboration Program", "Status": "Closed", "Project Description": "Our current proposal is to develop a low latency remote music collaboration tool, designed to let multiple musicians rehearse and write songs together in real-time over an internet connection. We imagine that this tool would be in the form of either a native application or a web application.", "TagA": "Software", "TagB": NaN, "Students": "Nicholas Popowich, Zexi Song, Shyang Huang", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020296, "Supervisor": "Lacra Pavel", "Project Title": "Restaurant Assistant Robot System", "Status": "Closed", "Project Description": "Description:", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Luis Camero, Lukasz Jagodzinski, Ki-Seok Hong", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020252, "Supervisor": "Kostas Plataniotis", "Project Title": "User Interface (UI)-Cloud based designs for Atlas of Digital Pathology data collection and compilation", "Status": "Closed", "Project Description": "Computational pathology aims to develop image diagnostics in digital pathology to aid pathologists in diagnosing digitized histo-pathological slides, namely from whole slide imaging (WSI) scanning platforms. Tissue. In a recent pilot project, we have introduced a unique labelling approach of histological tissue type (HTT) that has yielded the base for a novel Atlas of Digital Pathology (ADP) database [Published in CVPR2019]. The merit of such design is to enable the creation of a comprehensive database of tissue representations across diverse tissue types and body organs so that an AI engine e.g. Convolutional Neural Network (CNN) can be adopted to train (learn) such representations. Our early version of ADP consists of a limited number of organ tissues. This development shows great potential for applications such as organ classifier and abnormality detection applications. The challenge is to create a comprehensive ADP covering a broad spectrum of organs and tissues in a relative short period of time, a process that is manually intensive requiring experts (pathologists) time for annotation that is expensive and not readily available. In addition, we do not know how many patches are required to create a comprehensive ADP. Initially, in collaboration with Multimedia Lab at UofT, an executable software was developed to locally install annotation software on pathologists workstations. However, the physical installation is no longer feasible when it is to be distributed to multiple users across a large geographical region. Therefore, a cloud-based system is preferable for this increased distribution. We plan to introduce a new interactive web development by means of a User Interface (UI)-Cloud based designs for ADP data collection and compilation. This interactive web will be shared among pathologists online to collect their annotations across comprehensive collection of organs and tissues for the purpose of supervised database training of histological tissues in deep learning solutions. Specific tools that may be used in development are HTML, CSS, and Javascript for front end and Python and Java for back end. The proposed website must be as usable as possible. The following is a high-level plan on how to optimize usability with emphasis on three of Nielson's usability components which are Learnability, Efficiency, and Errors. Learnability will be achieved with an interface that is intuitive for many users. One way this will be achieved by having similar actions and interface to existing popular programs that the users are likely already familiar with. If a user is confused about a particular aspect, there will be an interactive tutorial the user can visit at any time. Efficiency will be achieved with flexibility and simplicity. Actions such as logging diseases will be accomplished in as few steps as possible and should be accessible by keyboard as well as mouse so that individuals can work in whichever method is faster for them. Errors should be minimized as a by-product of an effective design; however, the system should help the user detect and resolve any errors that do manifest. This could be done by having an algorithm analyze the labeling choices and ask for confirmation if the labeling seems inconsistent with other data. A specific design suggestion is to have a table of contents with the patches accessible as a side menu. The patches will be organized by the Convolutional Neural Network in the hierarchical taxonomy of the ADP and colour coded to indicate whether they have already been annotated. This is to allow the pathologists to label different patches as best suits their preferences while also allowing them to more easily resume progress.", "TagA": "Software", "TagB": NaN, "Students": "Jia Zhang, Jingxuan Su, Zhe Liu", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020244, "Supervisor": "Jonathan Rose", "Project Title": "Assess the quality of a conversation between two people using Natural Language Processing", "Status": "Closed", "Project Description": "The project aims to measure the quality of a conversation between two people using various criterias such as balancing between simplicity and details, transitioning between topics, asking/answering questions.", "TagA": "Software", "TagB": NaN, "Students": "Tim Fei, Kanglin Zeng, Ziang Zhang, Yueshuang Zhang", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020239, "Supervisor": "Costas Sarris", "Project Title": "Physics-based machine learning models for indoor Wi-Fi", "Status": "Closed", "Project Description": "The goal of this project is to develop an artificial neural network (ANN) model that uses measured and synthetic data to predict the power map generated by one or more wireless access points in an indoor environment. Measured data will consist of received power measurements in indoor hallways for various access point locations. The access points will be implemented with Raspberry Pi's.", "TagA": "Software", "TagB": "Computer Networks and Computer Hardware", "Students": "Matthew Viegas, Devesh Nischal, Danil Ojha, Tony Ma", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020219, "Supervisor": "Costas Sarris", "Project Title": "Physics-based machine learning models for indoor wireless localization", "Status": "Closed", "Project Description": "The goal of this project is to train a machine learning (ML) model that can recognize the relation between the coordinates of a user in an environment and the powers the user receives from 2-4 access points, hence performing user localization in that environment. The access points can be implemented with Raspberry Pi's or other means.", "TagA": "Software", "TagB": "Computer Networks and Computer Hardware", "Students": "Rakan Khoury, Farah Ashqar, Caroline Wood, Yi-Hsuan Yeh", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020202, "Supervisor": "Costas Sarris", "Project Title": "Physics-based machine learning models for indoor Wi-Fi / Team 2", "Status": "Closed", "Project Description": "The goal of this project is to develop an artificial neural network (ANN) model that uses measured and synthetic data to predict the power map generated by one or more wireless access points in an indoor environment. Measured data will consist of received power measurements in indoor hallways for various access point locations. The access points will be implemented with Raspberry Pi's.", "TagA": "Software", "TagB": "Computer Networks and Computer Hardware", "Students": "Shichen Ji, Shuyang Luo, Guoli Yang, Dongfang Cui", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020170, "Supervisor": "Yu Sun", "Project Title": "User interface and control strategy for a nano-manipulation tool", "Status": "Closed", "Project Description": "Professor Sun's group is developing a micro-cutting tool that is designed to cut biological samples such as brains, at a nanoscale. We are supposed to design a user interface for the system and also to come up with some non-linear control strategies.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Ang Li, Hongxiang Geng, Muyi Chen", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020269, "Supervisor": "Andreas Veneris", "Project Title": "Encrypted Rank Based Decentralized E-Voting System", "Status": "Closed", "Project Description": "Traditional voting remains relatively primitive and inaccessible to many people. E-voting has been proposed to address the short-comings, but most current methodologies are insecure, as the increasing threat of cyber hacking can greatly influence the outcomes of elections unfairly. Moreover, because of the current COVID-19 pandemic, the demand for a secure e-voting system, which can be completed from the comfort of your own home, is higher than ever. Blockchain technology can enable a secure, fair and transparent voting process. Current research has been limited to binary/plurality votes, the alternative rank based vote (Single Transferable Vote) aims to achieve a proportional representation.", "TagA": "Software", "TagB": NaN, "Students": "Kaixuan Wang, Jiachen Liu, Zixuan Nie, Curtis Lai", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020201, "Supervisor": "Belinda Wang", "Project Title": "Mozilla Dashboard Tool", "Status": "Closed", "Project Description": "This project is a collaboration with Mozilla to develop an internal tool that will automate the process of retrieving, organizing, and managing user account data. It will involve web technologies including ReactJS and GraphQL while making use of software concepts such as data analytics, cybersecurity, and with the possibility of machine learning.", "TagA": "Software", "TagB": NaN, "Students": "Gaurangi Siriya, Shanine Despacio, Ishmam Zaman, Akash Mathur", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020228, "Supervisor": "Willy Wong", "Project Title": "A remote monitoring system for the elderly", "Status": "Closed", "Project Description": "Development of a wireless sensor that will monitor patient vital signs and transmit this information to a centralized and secure server for real-time viewing by medical staff without the need for direct patient contact. Vital signs can include heart rate, blood oxygen saturation and blood pressure.", "TagA": "Software", "TagB": "Controls, Communications and Signal Processing", "Students": "Tianyi Xu, Akari Hashimoto, Jane Xue, Hao Wang", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020191, "Supervisor": "Ding Yuan", "Project Title": "MapReduced Log Processing and Management Framework", "Status": "Closed", "Project Description": "Create an API allowing for MapReduce processing on large datasets of compressed logs. The framework will allow a generalized method for users to create \"operators\" for log analysis. May be further extended by the implementation of a query language built ontop of the operator layer.", "TagA": "Software", "TagB": NaN, "Students": "Graham Sider, Rishikesh Devsot, Quinn Smith, Devin Gibson", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020261, "Supervisor": "Jose Zariffa", "Project Title": "Smart Mirror", "Status": "Closed", "Project Description": "In this project, the team will design a smart mirror that can be used to improve multitasking in everyday activities. All current smart mirrors are either too expensive, do not serve the intended purpose or both. Our solution should be cost-effective, allow for touch screen capability and customization of widgets/apps along the mirror. We should be using a microcontroller (Raspberry-Pi) and a 2-way mirror with plenty of room for future additional features like controlling lights and using facial features to unlock personal accounts.", "TagA": "Software", "TagB": "Computer Networks and Computer Hardware", "Students": "Youssef Bishay, Georges Loutfi, Nadine Hazzouri", "TagBVector": [0, 0, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}], "[0, 0, 1, 0, 0, 1]": [{"ID": "PROJ009", "Supervisor": "David Johns", "Project Title": "University analog electronics labs augmented with a microcontroller", "Status": "Open", "Project Description": "The goal of this project is to develop labs that are educational and interesting that can be used in 2nd and 3rd year analog electronics labs.", "TagA": "Analog and Digital Electronics", "TagB": " Software", "Students": NaN, "TagBVector": [0, 0, 1, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020263, "Supervisor": "Tony Chan Carusone", "Project Title": "Electronics Problem Set Generation", "Status": "Closed", "Project Description": "Develop a platform to randomize the parameter values in circuit schematics and then simulate or calculate other aspects of the resulting circuits' performance. The user will provide a template schematic, indicating the parameter(s) that are to be randomized and the range over which they may be varied (e.g. an inverting amplifier with varying resistor values). The user will also indicate the output parameters of interest (for example, the amplifier gain). The tool will then produce many (for example, 50) instances of the schematic and corresponding netlists based on the template with the parameter(s) randomly varied. For each instance of the schematic, the tool will also calculate or simulate the values of interest (e.g. the inverting amplifier gain corresponding to each combination of randomized resistor values). The tool will be useful in producing practice problem sets for electronics tutors and students. This project requires some knowledge of electronics simulation, as well as software development.", "TagA": "Software", "TagB": "Analog and Digital Electronics", "Students": "Aditya Patel, Alexander Boritz, Abishek Jayathirtha", "TagBVector": [0, 0, 1, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020158, "Supervisor": "Khoman Phang", "Project Title": "A CAD Tool for the Visualization and Manipulation of Signal-flow Graphs for Analog Circuits", "Status": "Closed", "Project Description": "This is a *software* project for the smart layout and interactive manipulation and visualization of analog circuits in the form of signal-flow graphs. It is intended to develop a CAD tool for circuit designers in industry. As such, it is intended for students seeking a software project in CAD development as applied to analog circuits.", "TagA": "Software", "TagB": "Analog and Digital Electronics", "Students": "Jingwu Hou, Shuo Chen, Youqing Sun", "TagBVector": [0, 0, 1, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}], "[0, 0, 1, 0, 0, 0]": [{"ID": "PROJ077", "Supervisor": "Andreas Moshovos", "Project Title": "Silicon implementation of Mixed Datatype Multiply Accumulate Units", "Status": "Open", "Project Description": "Develop an energy- and latency-efficient data parallel unit capable of floating- and fixed-point multiply accumulate. The goal is to use this for constructing machine learning accelerators where energy efficiency paramount. The team will have to survey past implementations and select a few for implementation using Verilog and Synopsys and Cadence tools. The implementation will target a specific technology from either TMSC or Globalfoundries.", "TagA": "Photonics and Semiconductor Phyics", "TagB": "Analog and Digital Electronics", "Students": NaN, "TagBVector": [0, 0, 1, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": "PROJ079", "Supervisor": "Andreas Moshovos", "Project Title": "FPGA implementation of the GOBO hardware engine for Machine Learning Natural Language Tasks", "Status": "Open", "Project Description": "Develop an FPGA implementation of the GOBO accelerator: see https://arxiv.org/abs/2005.03842 for a description of the quantization method used which reduces model size by 10x. The team will be provided with a full description of the accelerator.", "TagA": "Computer Hardware and Computer Networks", "TagB": "Analog and Digital Electronics", "Students": NaN, "TagBVector": [0, 0, 1, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": "PROJ042", "Supervisor": "Yu Sun", "Project Title": "Magnetic guidewire control for robotic surgery", "Status": "Open", "Project Description": "The longer a blood vessel in the brain is blocked during a stroke, the more neurons die - up to 1.9 million per minute. However, patients in rural communities are suffering from lack of therapists. Thus, remote minimal invasive stroke surgery will help suburb patients to get treatment as soon as possible. In the remote surgery, after the catheters and guidewire are deployed, the guidewire must be navigated to the site of the blood clot. For when there is no experienced surgeon on site, a magnetically controllable guidewire has been developed. The navigation process requires bending and twisting the guidewire tip by controlling the magnetic field. It has been shown that a hand-held magnet can be used to navigate a magnetic guidewire in a phantom. However, manual control is not suitable for in vivo use where the vasculature network is complex and not suitable for remote surgery.", "TagA": "Controls, Communications and Signal Processing", "TagB": "Analog and Digital Electronics Hardware", "Students": NaN, "TagBVector": [0, 0, 1, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": "PROJ043", "Supervisor": "Yu Sun", "Project Title": "Robotic needle insertion for remote surgery", "Status": "Open", "Project Description": "The longer a blood vessel in the brain is blocked during a stroke, the more neurons die-up to 1.9 million per minute. However, patients in rural communities are suffering from the lack of therapists. Thus, remote minimal invasive stroke surgery will help suburb patients to get treatment as soon as possible. Needle insertion is the first essential step for remote surgery. Robotic needle insertion is intrinsically robotic manipulation of deformable objects. Once the devices are inserted into the femoral artery they can then be navigated to the brain via the aorta and subsequently the carotid or vertebral arteries. This insertion step most commonly uses the femoral artery because it an accessible site, has a wide caliber, and can be compressed in case of bleeding.", "TagA": "Controls, Communications and Signal Processing", "TagB": "Analog and Digital Electronics", "Students": NaN, "TagBVector": [0, 0, 1, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020214, "Supervisor": "Tony Chan Carusone", "Project Title": "Automated Analog Integrated Circuit Design", "Status": "Closed", "Project Description": "Starting with a few high-level specifications, develop automated tools for the design of integrated circuits such as clock buffers, including:", "TagA": "Computer Hardware and Computer Networks", "TagB": "Analog and Digital Electronics", "Students": "Shushu Xiang, Danlu Liu, Sheng Piao", "TagBVector": [0, 0, 1, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020301, "Supervisor": "Hans Kunov", "Project Title": "Time keeping with a twist", "Status": "Closed", "Project Description": "Based on a conventional, old, or unusual time-keeping mechanism, possibly one of your own imagination, design a modified one that is extremely (and therefore surprisingly) accurate. The \"secret\" is a hidden modern clock (built-in or internet provided) that speeds up or slows down the clock from time to time. The time keeper could be a pendulum clock, an ancient pre-pendulum clock, an electronic or mechanical contraption of your own design. The source of time-keeping could be falling water, balls, sand, a mass-spring system, a random (or non-random) noise source, etc.", "TagA": "Controls, Communications and Signal Processing", "TagB": "Analog and Digital Electronics", "Students": "Jong Park, Jun-Soo Yeo, Akshay Vallookaran", "TagBVector": [0, 0, 1, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020178, "Supervisor": "Wai Tung Ng", "Project Title": "High Fidelity Quality Class D Power Amplifiers", "Status": "Closed", "Project Description": "Class D power amplifier is a popular topology to provide high efficiency for a wide range of power ratings. The implementation of the power output stage using GaN power transistors together with pulse width modulation is gaining wide acceptance in current consumer and mobile electronics markets. Students will be designing a full digital audio amplifier starting with the design of a digital modulator using FPGA to a discrete GaN H-bridge output stage. In order to engage in this project, students will be required to learn a variety of topics including digital signal processing, gate driver design, power transistor characteristics, LC filter design, and audio testing techniques.", "TagA": "Computer Hardware and Computer Networks", "TagB": "Analog and Digital Electronics", "Students": "Cheng Feng Wang, Yihan Tian", "TagBVector": [0, 0, 1, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020168, "Supervisor": "Shahrokh Valaee", "Project Title": "Designing the hardware for an interactive voice assistant to support healthcare workers in rural Kenya", "Status": "Closed", "Project Description": "In Kenya, 1 in 3 children in undernourished, resulting in poor health during adolescence and adulthood. Community Health Volunteers (CHVs), while an asset to their communities, should not be the only source of child health and nutrition messages among primary caretakers. CHVs are not part of the public health system and are not compensated by the government for the services they are providing. Therefore, dropout rates are high, and those who are working are not always available, resulting in gaps in essential health messages reaching the primary caretakers. Caretakers need multiple channels where they can access evidence-based health and nutrition information.", "TagA": "Computer Hardware and Computer Networks", "TagB": "Analog and Digital Electronics", "Students": "Pouyan Tahmasebipour, Shakibasadat Tonekabonipour, Cameron Rogers, Elizabeth Bertozzi", "TagBVector": [0, 0, 1, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}], "[0, 0, 0, 0, 1, 1]": [{"ID": 2020174, "Supervisor": "Paul Chow", "Project Title": "Integrating Wireshark with a FPGA BPF Engine (FFShark) for Packet Analysis of High Speed Networks (100G)", "Status": "Closed", "Project Description": "FFShark is really just the BPF engine that does the main work of Wireshark. To actually use FFShark as Wireshark, we need to add the Wireshark GUI. This project would integrate FFShark into Wireshark so that you can make use of all the functions of Wireshark and the GUI. Wireshark currently assumes it is talking to the BPF virtual machine in the kernel. We need to figure out how Wireshark communicates with the internal BPF and modify it to talk to FFShark over the network. This is one option but it has the downside that if the baseline Wireshark is modified, then all the changes would have to be reintegrated, unless Wireshark happens to be modular enough that changes can be made easily. A harder option is that there is some code that enables Wireshark to connect to a remote machine to capture packets, which is essentially what we are trying to do here, except that the remote machine is an FPGA. This may be a \"better\" approach in that if we make it work, then changes to Wireshark is less likely to require custom upgrades to use FFShark. It is riskier because of uncertainty about whether that code is reliable. Depending on how the tasks break down, we might try both approaches if time allows.", "TagA": "Software", "TagB": "Computer Hardware & Computer Networks", "Students": "Kanver Bhandal, Alexander Buck, Tobias Rozario", "TagBVector": [0, 0, 0, 0, 1, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020229, "Supervisor": "David Lie", "Project Title": "A local covid-19 tracking system for in-door public areas", "Status": "Closed", "Project Description": "The goal of this project is to design a precise and privacy-oriented solution to track COVID-19 exposures and promote social distancing. The project seeks to utilize smart devices with non-contact technologies such as NFC, bluetooth and WIFI to tag and communicate between individuals. The users of the system will be able to voluntarily self-report as positives to generate warnings about exposures to other individuals in the network.", "TagA": "Software", "TagB": "Computer Hardware & Computer Networks", "Students": "Yuqing Zhao, Jie Bian, Yipeng Li", "TagBVector": [0, 0, 0, 0, 1, 1], "id": "2020-2021 Professor Interests 405"}], "[0, 0, 0, 0, 1, 0]": [{"ID": 2020291, "Supervisor": "Natalie Enright Jerger", "Project Title": "Energy Harvesting IoT Device Network", "Status": "Closed", "Project Description": "Our goal is to create a network of energy-harvesting IoT devices working to gather and transmit sensor information, as well as distribute tasks where there is a device with available processing power. The IoT device's ability to harvest ambient energy makes it an ideal tool for applications that require information-gathering in remote areas, such as large bodies of water. Our application of interest is to create a network of energy-harvesting IoT devices that can be deployed in oceans (or other remote waters) to gather important water quality information, such as temperature, salinity, conductivity, CO2 levels, and more. This allows for continuous water-monitoring with minimal human intervention.", "TagA": "Computer Hardware & Computer Networks", "TagB": "Controls, Communications and Signal Processing", "Students": "Kathryn Tremblay, Danja Papajani, Kamau Bridgeman", "TagBVector": [0, 0, 0, 0, 1, 0], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020295, "Supervisor": "Jorg Liebeherr", "Project Title": "Remote monitoring system for sustainable sanitation in peri-urban areas", "Status": "Closed", "Project Description": "This project is relates to a project involving the CGEN (Center for Global Engineering) for sustainable sanitation in a peri-urban area in Mexico City.", "TagA": "Computer Hardware & Computer Networks", "TagB": "Controls, Communications and Signal Processing", "Students": "Rui Zhou, Sheng Zhao, Michael Ying", "TagBVector": [0, 0, 0, 0, 1, 0], "id": "2020-2021 Professor Interests 405"}], "[0, 1, 0, 0, 0, 0]": [{"ID": 2020226, "Supervisor": "Sean Hum", "Project Title": "Automated antenna tuner", "Status": "Closed", "Project Description": "Teams will develop an automated impedance tuner to automatically match a transceiver to an antenna. This project is for teams interested in radio frequency circuits and/or electromagnetics. The targeted frequency range is in the HF/VHF/microwave frequency range according to the interests of the team. Knowledge of ECE320 is required.", "TagA": "Electromagnetics and Energy Systems", "TagB": NaN, "Students": "Roshan Reginold, Eileen Lau, Miguel Andal", "TagBVector": [0, 1, 0, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}], "[0, 1, 0, 0, 1, 1]": [{"ID": 2020260, "Supervisor": "Jorg Liebeherr", "Project Title": "Designing a rainwater monitoring system to combat water scarcity in slums of Mexico City", "Status": "Closed", "Project Description": "Water scarcity is a massive challenge facing slums across Mexico City. TECHO, a Mexican NGO which builds transitional housing for people living in extreme poverty, has been addressing this problem by building rainwater harvesting systems in informal settlements to meet their needs. The problem, however, is that they do not know where to best place those systems to maximize water collection. The objective, therefore, of this project is to develop a data collection system for rainwater usage for a community that can scale up to 100 monitoring sites.", "TagA": "Software", "TagB": "Electromagnetics and Energy Systems, Controls, Communications and Signal Processing, Computer Hardware & Computer Networks", "Students": "Justin Leung, Jeremy Lee, Yong Zhang", "TagBVector": [0, 1, 0, 0, 1, 1], "id": "2020-2021 Professor Interests 405"}], "[0, 0, 0, 1, 0, 1]": [{"ID": 2020303, "Supervisor": "Andreas Moshovos", "Project Title": "Video based collision warning for boating", "Status": "Closed", "Project Description": "Goal is to develop a low cost solution for alerting boat operators of potential visible hazards. Boating accidents happen every year any many are due to the lack of attention from boat operators. The goal is to develop a machine learning based solution that would signal potential hazards. Using a 3D engine the team would have to develop a synthetic dataset that can be used to train a neural network for this purpose. In addition the team will have to develop a prototype implementation using a graphics processor on a desktop or laptop class system. Then, if time permits, scale this down to an IoT/Embedded scale system. Support for equipment will be provided.", "TagA": "Software", "TagB": "Control, Communications and Signal Processing", "Students": "Ayaz Kadam, Asad Jamil, Uzair Ashraf", "TagBVector": [0, 0, 0, 1, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020292, "Supervisor": "Adrian Nachman", "Project Title": "Sharpening Ultrasound Images using CycleWGANs", "Status": "Closed", "Project Description": "Topic Category: Machine Learning Applied to Medical Imaging", "TagA": "Software", "TagB": "Control, Communications and Signal Processing", "Students": "Joseph Capan, Justin Chu, Stefan Stancu", "TagBVector": [0, 0, 0, 1, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020241, "Supervisor": "Adrian Nachman", "Project Title": "Deep Internal Learning for Audio Super Resolution", "Status": "Closed", "Project Description": "In this project, we propose an approach that, unlike most Deep Learning methods that require large amounts of training data, seeks to train a bespoke neural-net based only on input from the one given signal. We will aim to investigate whether there is sufficient internal recurrence of information in speech or music to allow for bandwidth extension, analogous to the impressive results obtained in imaging.", "TagA": "Software", "TagB": "Control, Communications and Signal Processing", "Students": "Shayan Hashem Zehi, Michael Karras, Michelle DiMarco", "TagBVector": [0, 0, 0, 1, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020302, "Supervisor": "John Simpson-Porco", "Project Title": "A monitoring and forecast system for distributed energy resources using deep learning", "Status": "Closed", "Project Description": "The goal of this project is to establish a system for energy demand monitoring and forecasting using deep learning. A front-end user interface will be implemented, in order to provide potential users with anomaly identifications based on the forecast predictions, where areas with an abnormally high or low level of energy are being consumed are flagged based on forecast predictions.", "TagA": "Software", "TagB": "Control, Communications and Signal Processing", "Students": "Yuwen Zheng, Xingwen Li, Thomas Huang, Ting Ray Wang", "TagBVector": [0, 0, 0, 1, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020250, "Supervisor": "Michael Stumm", "Project Title": "Video Segment Searching Tool", "Status": "Closed", "Project Description": "Motivation:", "TagA": "Software", "TagB": "Control, Communications and Signal Processing", "Students": "Chenhong Qiu, Yixuan Liu, Yan Huang, Xiaolin Liu", "TagBVector": [0, 0, 0, 1, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020283, "Supervisor": "Yu Sun", "Project Title": "A web-based software platform powered by AI to grade embryo morphology and annotate morphokinetic parameters", "Status": "Closed", "Project Description": "Background:", "TagA": "Software", "TagB": "Control, Communications and Signal Processing", "Students": "Marinette Chen, Byeong Jun Kim, Ahanaf Rakin, Hammad Mohiuddin", "TagBVector": [0, 0, 0, 1, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020227, "Supervisor": "Hamid Timorabadi", "Project Title": "Mobile Medical Diagnosis App", "Status": "Closed", "Project Description": "68% of Canadians skip seeing doctors due to a variety of factors, such as physical barriers, fear of contamination, and long wait times. About 56% of Canadians said it took longer than four weeks to see a specialist for their conditions. These statistics alone can discourage many from seeking professional medical assistance, as they may deem their condition not serious enough to merit such a long wait.", "TagA": "Software", "TagB": "Control, Communications and Signal Processing", "Students": "Thomas Nguyen, Chanwoong Won, Christopher Pua, Soo Cho", "TagBVector": [0, 0, 0, 1, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020173, "Supervisor": "Hamid Timorabadi", "Project Title": "Video Conferencing Feedback", "Status": "Closed", "Project Description": "With the advent of COVID-19, billions of people are studying, working and communicating remotely. We propose a system that uses AI to provide the presenter qualitative and quantitative feedback on audience engagement level. The presenter can use this feedback to effectively modify their presentation.", "TagA": "Software", "TagB": "Control, Communications and Signal Processing", "Students": "Manik Chaudhery, Janpreet Chandhok, Jeremy Stairs, Raman Mangla", "TagBVector": [0, 0, 0, 1, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020160, "Supervisor": "Hamid Timorabadi", "Project Title": "Photo Synthesis", "Status": "Closed", "Project Description": "Today, with the abundance of storage solutions and mobile phones, the average person takes thousands of photos a year. Many of which are simply deleted due to some untimely characteristic, a friend was blinking, another was not ready for the photo or maybe a stranger walked by and ruined the background. The idea is to create an application that would be capable of merging a burst of several photos into one photo with non-ideal traits removed. The project will be implemented feature by feature, for example one feature could be to merge a set of photos where people took turns blinking and create a final photo where everyone has their eyes open. Another feature could be to clean up any interruptions from the background. The final number of features for this project is open ended depending on complexity and time but the idea is that the features can work independently of each other and multiple can be applied to the same set of images to generate one final image with no blinks and an unobstructed background. In order to implement these photo reconstructions, we will employ computer vision and ML algorithms for face detection and image processing.", "TagA": "Software", "TagB": "Control, Communications and Signal Processing", "Students": "Run Yu, Xinzhe Lin, Jia Zou, Jeff Liu", "TagBVector": [0, 0, 0, 1, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020248, "Supervisor": "Shahrokh Valaee", "Project Title": "Privacy-centric Speech Recording for a Single User", "Status": "Closed", "Project Description": "Create a full solution (client app, web server, and database) that will allow a user to record only their voice in a noisy environment (e.g. presentation/meeting room) and then fetch the encrypted recording for future consumption. The system will use machine learning and/or signal processing techniques to isolate the one speaker from the recording, discarding noise and other speakers.", "TagA": "Software", "TagB": "Control, Communications and Signal Processing", "Students": "Amar Arefeen, Nicholas Leung, Michael Condo, Ravi Singh", "TagBVector": [0, 0, 0, 1, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020254, "Supervisor": "Andreas Veneris", "Project Title": "A Dapp using smart contract to insure stock market losses", "Status": "Closed", "Project Description": "The project aims to explore the application of the most popular technology, blockchain technology, in the financial market. The decentralized application has a strong secure, immutable, and transparent mechanism to keep a safe transaction and low cost of finance management.We develop a Dapp about insuring stock market losses for investors in market volatility. It should provide guidance to the clients to diversify the portfolio to reduce risk, monitor the option strikes, and enable closeout or buy in when the price reaches a predetermined point.", "TagA": "Software", "TagB": "Control, Communications and Signal Processing", "Students": "Anzhe Dong, Jinze Hao, Bowen Wu, Chao Shan", "TagBVector": [0, 0, 0, 1, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020270, "Supervisor": "Andreas Veneris", "Project Title": "Move Smart Contract Synthesis and Verification", "Status": "Closed", "Project Description": "This project explores the area of smart contract synthesis and verification. Smart contracts are written in various programming languages such as Solidity. As with many programming languages, there is often a lack of formal semantic definition and developer familiarity. This can lead to unexpected bugs and contracts that are much more vulnerable to malicious attacks. For this reason, the VeriSolid framework was created to specifically help with the development of Solidity smart contracts on the Ethereum platform.", "TagA": "Software", "TagB": "Control, Communications and Signal Processing", "Students": "Pranavbhai Patel, Kevin Raihanizadeh, Arjun Mittal, Rohit Arora", "TagBVector": [0, 0, 0, 1, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020278, "Supervisor": "Andreas Veneris", "Project Title": "Valuation of an Asset for Insurance", "Status": "Closed", "Project Description": "The team will develop a machine learning (ML) model that will give the valuation of an asset such as a building within a specified time frame in a select number of cities. The model will accept inputs of specific information about the asset (building) such as specific location, the current date, inflation rate, GDP and the building cost index. Machine learning is a suitable candidate for this problem since our model will predict future changing market trends and conditions.", "TagA": "Software", "TagB": "Control, Communications and Signal Processing", "Students": "YiFei Tang, Dylan Yakobovits, Radomir Djogo, Yang Wan", "TagBVector": [0, 0, 0, 1, 0, 1], "id": "2020-2021 Professor Interests 405"}, {"ID": 2020212, "Supervisor": "Jose Zariffa", "Project Title": "Remote Monitoring of Patients with Health Conditions", "Status": "Closed", "Project Description": "This project will focus on creating a mobile application to remotely monitor patients who have a certain subset of health conditions so that they can effectively manage their health and keep track of their progress at home. Our goal is to keep track of their symptoms, past medical history and lab tests and use machine learning to classify if those symptoms are unusual, if the patient needs hospitalization, or if they are showing symptoms of developing another related disease. There will be two user modes: a doctor mode and a patient mode. The doctor mode will allow doctors to monitor multiple patients while the patient mode will allow patients or caretakers to track their symptoms. Conversational AI would also be used for accessibility, and the user will be able to talk to the chatbot in the app and describe their symptoms. The chatbot would ask simple questions that a doctor would ask, and the responses from the user would be used for the diagnosis.", "TagA": "Software", "TagB": "Control, Communications and Signal Processing", "Students": "Sai Harshita Tupili, Suyasha Acharya, Amanda Steinhauer, Arfa Saif", "TagBVector": [0, 0, 0, 1, 0, 1], "id": "2020-2021 Professor Interests 405"}], "[1, 1, 0, 0, 0, 0]": [{"ID": 2020217, "Supervisor": "Wai Tung Ng", "Project Title": "GaN Power Converters", "Status": "Closed", "Project Description": "Gallium Nitride (GaN) is the next generation power semiconductor devices. They promise to delivery higher power density and high power efficiency. Students in this project will design, build and test a DC-DC power converter (with voltage and current ratings to be determined) that can out-perform the current silicon counterparts. Students will learn how to use of the shelf parts to implement a PWM controller, selection of various electronic components, simulation using dedicated software for power electronics and the design and implementation of printed circuit boards. It is expected that the students in this project will acquire practical hands-on experience to further their understanding in power electronics.", "TagA": "Electromagnetics and Energy Systems", "TagB": "Photonics and Semiconductor Physics", "Students": "Aaron Kammula, Zhongyan Liu", "TagBVector": [1, 1, 0, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}], "[0, 1, 0, 0, 0, 1]": [{"ID": 2020237, "Supervisor": "Ali Sheikholeslami", "Project Title": "Optical Transceiver", "Status": "Closed", "Project Description": "With the ever increasing data traffic, it is expected that most traditional electrical interconnects in data-centres will be replaced with optical interconnects. The latter provides benefits such as high speed and power efficiency. The group plans to design an optical transceiver using primarily off-the-shelf optical and electrical components.", "TagA": "Software", "TagB": "Electromagnetics and Energy Systems", "Students": "Mingyue Li, Alexander Greenwood, Yinxin He", "TagBVector": [0, 1, 0, 0, 0, 1], "id": "2020-2021 Professor Interests 405"}], "[0, 1, 1, 0, 0, 0]": [{"ID": 2020284, "Supervisor": "Olivier Trescases", "Project Title": "Battery Assisted DC Fast Charger for Electric Vehicles", "Status": "Closed", "Project Description": "Second-life electric vehicle (EV) batteries will be used to supplement grid electricity, allowing the charger to take advantage of time of day electricity pricing and reducing strain on the grid when charging. The charger will charge EVs using the CHAdeMO plug & quick-charging method.", "TagA": "Electromagnetics and Energy Systems", "TagB": "Analog and Digital Electronics", "Students": "Seif Sarofim, Michelle Tessy, Dylan Lamont", "TagBVector": [0, 1, 1, 0, 0, 0], "id": "2020-2021 Professor Interests 405"}]}